app/views/home/review.erb

<div class="container" style="margin-top: 40px">
    <% @address.addressreviews.each do |r| %>
---
SELECT "addressreviews".* FROM "addressreviews" WHERE "addressreviews"."address_id" = ?  [["address_id", 1]]

                <div class="reply_comment_<%= @address.id %>">
                  <% @address.comments.reverse.each do |c| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."address_id" = ?  [["address_id", 1]]