app/controllers/home_controller.rb

    def create_b
      @create_review = Address.all
---
SELECT "addresses".* FROM "addresses"

    def list_path_a
      # email = User.new
      # email.email = params[:email]

      # Address.get_address_save
      address = Address.new
      address.marker1 = params[:marker1]
      address.marker2 = params[:marker2]
      address.address = params[:address]
      address.detail_address = params[:detail_address]
      address.current_user = params[:current_user]
      address.save
---
INSERT INTO "addresses" ("marker1", "marker2", "address", "detail_address", "current_user", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def list_path_b
      @address = Address.find(params[:address_id])
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT 1  [["id", 1]]

    def list_find
      @address = Address.all.reverse
      @address = Address.includes(:addressreviews).all
---
SELECT "addresses".* FROM "addresses"
SELECT "addressreviews".* FROM "addressreviews" WHERE "addressreviews"."address_id" IN (1)

    def review
      @address = Address.find(params[:address_id])
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT 1  [["id", 1]]

    def mypage
      @address = Address.all.reverse
---
SELECT "addresses".* FROM "addresses"

    def review_path
      comment = Comment.new
      comment.address_id = params[:address_id]
      comment.author = params[:author]
      comment.comment = params[:comment]
      comment.save
---
INSERT INTO "comments" ("address_id", "author", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["address_id", 1], ["author", "test1@email.com"], ["comment", "댓글 숑숑"], ["created_at", "2016-08-05 11:15:02.558029"], ["updated_at", "2016-08-05 11:15:02.558029"]]